<?php

use Illuminate\Support\Facades\Route;
use App\Http\Controllers\CinemaController;
/*
|--------------------------------------------------------------------------
| Web Routes
|--------------------------------------------------------------------------
|
| Here is where you can register web routes for your application. These
| routes are loaded by the RouteServiceProvider within a group which
| contains the "web" middleware group. Now create something great!
|
*/

Route::get('/', function () {
    return view('welcome');
});
Route::get('30nama', [CinemaController::class, 'getSiteUrl']);
Route::get('/quote', function () {
	$quotes = [
		'نفسم شاید دلیل زنده بودنم باشد
ولی بی شک
تو تنها دلیل همین نفسی',
		'با تو قدم زدن را آنقدر دوست دارم

که به جای خانه برای عشقمان

جاده خواهم ساخت',
		'یه وقتایی فراموش کردن بعضیا

مثل فراموش کردن نفس کشیدنه

درست مثل فراموش کردن تو',
		'تو را باید یک نفس بویید

حیف است عطرت را هوا ببلعد
',
		'دوست داشتن ساده است و باور کردنش سخت

تو ساده باور کن

که من سخت دوستت دارم …',
		'عشق فریب بزرگی است

اما دوست داشتن یک صداقت بی انتهاست …',
		'صبح یعنی مست صدای تو

ظهر یعنی انتظار تو 

عصر یعنی دلتنگم برای تو

شب یعنی یاد تو 

و تو یعنی تمام لحظه های من',
		'بعضی ها خودشان

دلیل دوست داشتنشان می شوند

آنهایی که می گویند

با هم راه برویم

با هم درستش می کنیم

با هم کلا کیف دارد',
		'از تو دور بودن پر توقعم کرده 

حالا دیگر تمام تو را میخواهم

تا بشوم ثروتمند ترین فرد روى زمین ',
		'آنقدر دوستت دارم که پروانه ها گیج می شوند

گل ها تعجب می کنند

و باران دلش آب می افتد !',
		'عاشقانه دوست داشتنت

تنها کار عاقلانه ای ست که از دلم بر می آید',
		'بعضی ترانه ها را می توان بارها و بارها گوش داد

بعضی انسان ها را می توان بارها و بارها دوست داشت',
		'و عشق اگر با حضور همین روزمرگی‌ ها عشق بماند عشق است',
		'آرزویم این است که بهاری بشود روز و شبت

که ببارد به تمام رخ تو بارش شادی و شعف

و من از دور ببینم که پر از لبخند است : چشم و دنیا و دلت',
		' وقتی قهر میکنه

باید بش بگی میای بغلم

یا بیارمت',
		'عاشقم باش و کنارم بمان

بگذار آوازه ی عشقمان چنان در شهر بپیچد که روسیاه شوند

آنها که بر سر جداییمان شرط بسته اند',
		'تمام دنیا هم که بروند

تمام دنیا هم که نباشند

تمام دنیا هم که مرا نخواهند

تمام دنیا هم که آوار شود برسرم

تو هستی

همین برای یک عمر دلخوشی کافیست',
		'می خندی و زمین بهشت می شود

باید بوسید

دست طرّاح خندهایت را',
		'نگاهم به جهان رنگ میگیره …

من ،خوشبخت ترین بانوی این جهان خاکی ا

م وقتی جهانم با تو قسمت میشه
',
		'رابطه ها زمانی زیبا می شوند که برای یاد کردن

هیچ دلیلی به جز دلتنگی نباشد',
		' من تو را دوست دارم

نه از روی تنهایی

نه از روی نیاز

تنها به این دلیل که تو سزاوار عشق منی',
		'زندگی؛ ساخته عشق است

 به هر اندازه عاشقی به همان اندازه زندگی خواهی کرد',
		'جانم باش تا به لبم برسی

می خواهم همه ببینند با تو جان به لب شدم',
		'خوشبختی همین کنار هم بودنهاست

همین دوست داشتن‌ هاست

خوشبختی همین لحظه‌های ماست

همین ثانیه‌‌هاییست که در شتاب زندگی گمشان کرده‌ایم',
		'هر شب قبل از خواب

بى آنكه با خبر باشى

جولان میدهى در خيالم

گاه با لبخندى گوشه‌ لب

گاه با اشكى سرازير از گونه

به هر جان كندنى شده

خودت را نه

خيالت را حبس می‌ کنم در خوابم',
		'قشنگی عشق به این است

که کسی باشد بی وقفه

تو را دوست بدارد …',
		'تو تنها می‌ توانی

آخرین درمانِ من باشی …

و بی‌ شک دیگران

بیهوده می‌ جویند تسکینم …!
',
		'تمام آنچه دانسته‌ ام

همین است:

تو عشق منی

و آنکه عاشق است هیچ چیز نمی‌ داند',
		'تا عطر تنت اینجاست

نبضم به تو وابسته‌ ست

با بوی نفس‌ هایت

جانانه شدن با من',
		'باخیالت زنده‌ ام

رویای من تعبیر شو

در كنارم زندگى كن

در کنارم پیرشو',
		'اشتباه نکن

نه زیبایی تو، نه محبوبیت تو

مرا مجذوب خود نکرد

تنها آن هنگام

که روح زخمی مرا بوسیدی

من عاشقت شدم',
		'تو دوست داشتنی‌ ترين پيچكی هستی

كه دلم می‌ خواهد

به دست و پای زندگيم بپيچی

و مدام قد بكشی در لحظه‌ هايم

و حالم را خوب‌ تر كنی',
		'قشنگ‌ ترین موسیقی جهان

صدای قلب کسی‌ است

که عاشقش هستی',
		'تو همانی که می‌ شود

چای را کنارت

بدون قند شیرین نوشید',
		'حرف بوسه که بیاید

لب‌ هایم پیش قدم بوسیدن

مُهر پیشانی‌ ات می‌ شود

هر روز، هر لحظه، هر ثانیه

و به نیت بوسیدن پیشانیت

قد علم می‌ کنم',
		'گفته‌ اند به کم قانع باشید

من به همین عاشقانه نوشتن از تو

قانع‌ ام ..

آرام می‌ گیرم به همین آب باریک عاشقی',
		'برای خنده‌ های تو، صدای تو

دلم تنگ‌ است

اگرچه با خیالت

لحظه‌ لحظه گفتگو دارم',
		'من به اعتماد حضورت

به جهان پشت کرده‌ ام

که تنها، تو

پشت و پناه من شوی',
		'تو موسیقی بی کلامی

و من دوست دارم

هر روز تو را تکرار کنم

تو نهایت آرامشی',
		'چه حالِ خوبی ست

هواى دونفره

دست‌ هاى دونفره

يک آهنگِ دنج

و جاده يک طرفه

من باشم و تو باشى

و دوست داشتنى كه تمام نشود',
		'با تو که باشم

زمان از دستم می‌ رود

جایی که تو باشی و من

زمان جایی ندارد',
		'بند دل من

به لبخندهای تو بند است

برای دوست داشتنت اما

لبخندهایت را نه

دلت را لازم دارم
',
		'دوستت دارم

و اين تنها كارى‌ ست

كه شنبه و جمعه

هفته و ماه و سال

نمى‌ شناسد …',
		'طوری کنارت می‌ مانم

طوری برایت خاطره می‌ سازم

که حتی اگر بخواهی هم  نتوانی ترکم کنی

آخر من فکر می‌کنم هیچ رفتنی

حریف خاطره‌ ها نمی‌ شود',
	];
	return view('quote')->with('quotes', $quotes);
});
